---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCLevelInfo.Dispose
source: html/38d90624-d797-3e36-c0f1-9b33819bf089.htm
---
# Autodesk.Revit.DB.IFC.IFCLevelInfo.Dispose Method

Releases all resources used by the IFCLevelInfo

## Syntax (C#)
```csharp
public void Dispose()
```